IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/VTM0_MMR_VBUSP_CFG1.xml
<module name="VTM0_MMR_VBUSP_CFG1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MMR__VBUSP__CFG1_VTM_PID" acronym="MMR__VBUSP__CFG1_VTM_PID" offset="0x0" width="32" description="VTM Peripheral Identification Register">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID follows new scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business unit - Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1563" description="Module functional identifier - CTRL MMR" range="27 - 16" rwaccess="R"/> 
		<bitfield id="R_RTL" width="5" begin="15" end="11" resetval="0x15" description="RTL revision number - actual value determined by RTL" range="15 - 11" rwaccess="R"/> 
		<bitfield id="X_MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision number - actual value determined by RTL" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number - actual value determined by RTL" range="7 - 6" rwaccess="R"/> 
		<bitfield id="Y_MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision number - actual value determined by RTL" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_DEVINFO_PWR0" acronym="MMR__VBUSP__CFG1_VTM_DEVINFO_PWR0" offset="0x4" width="32" description="Device specific voltage domain and temp sensor information register.">
		<bitfield id="VTM_VD_MAP" width="4" begin="19" end="16" resetval="0x0" description="Core voltage domain, cVD, global mapping 4-bit code, in the context of this SOC. It shows in which cVD this VTM is instantiated/placed. This field indicates in which core voltage domain, cVD, has been physically placed this VTM. Valid values: 0x0 to 0xE where: 0x0 = VD_RTC, not present is some SOCs, 0x1 = VD_WKUP, 0x2 = VD_MCU, 0x3 = VD_CORE, not present is some SOCs, 0x4-0xE = Mapping varies between SOCs, 0xF = not implemented. Reset value is a VTM tieoff, d_vtm_vd_map." range="19 - 16" rwaccess="R"/> 
		<bitfield id="VD_RTC" width="1" begin="12" end="12" resetval="0x0" description="RTC voltage domain presence. 0: There is NO VD_RTC in this SOC. 1: There is a VD_RTC in this SOC. Reset value is a VTM tieoff, d_vd_rtc." range="12" rwaccess="R"/> 
		<bitfield id="TMPSENS_CT" width="4" begin="7" end="4" resetval="0x0" description="Number of temperature sensors associated with this VTM. Valid values are 4'h0 - 4'h8. 0x0: NO temp-sensor associated to this VTM. 0x8: 8 temp-sensors associated to this VTM. 0x9 to 0xF: invalid values. Reset value is a VTM tieoff, d_vtm_tmpsens_ct." range="7 - 4" rwaccess="R"/> 
		<bitfield id="CVD_CT" width="4" begin="3" end="0" resetval="0x0" description="Number of core voltage domains in device. VD0 is always allocated to VD_RTC, if it exists, and VD1 always to VD_WKUP. The maximum number of cVDs in an SOC is 15, 0xF. Reset value is a VTM tieoff, d_device_cvd_ct." range="3 - 0" rwaccess="R"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_RAW_STAT_SET" acronym="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_RAW_STAT_SET" offset="0x204" width="32" description="Interrupt RAW event status and set MMR for interrupt GT_TH1 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH1_INT_EN_STAT_CLR are fully linked for write operation, but partially linked for reads, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR. However the reads to these 2 MMRs don't yield the same read data. Reads to *_INT_RAW_STAT_SET return the full raw events contents of the common linked MMR, whereas reads to MMR *_INT_EN_STAT_CLR will yield the masked-content of the linked MMR. The mask for the read is defined by the contents of the related MMR *_INT_EN_SET/CLR.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt pending bit set for gt_th1_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the interrupt flag to be set. Used to manually force/drive an interrupt pending event. Reads return the pending stats regardless of the corresponding enable setting." range="7 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_EN_STAT_CLR" acronym="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_EN_STAT_CLR" offset="0x208" width="32" description="Enabled interrupt event status and clear MMR for interrupt GT_TH1 per voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH1_INT_RAW_STAT_SET are fully linked for write operation, but partially linked for reads, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR. However the reads to these 2 MMRs don't yield the same read data. Reads to *_INT_RAW_STAT_SET return the full raw events contents of the common linked MMR, whereas reads to MMR *_INT_EN_STAT_CLR will yield the masked-content of the linked MMR. The mask for the read is defined by the contents of the related MMR *_INT_EN_SET/CLR.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt masked pending bit for gt_th1_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the pending bit to be cleared. Reads return the enabled pending status that includes the corresponding enable setting." range="7 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_EN_SET" acronym="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_EN_SET" offset="0x214" width="32" description="Enable set MMR for interrupt GT_TH1 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH1_INT_EN_CLR are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enable bit for gt_th1_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the bit to be set to 1. Reads return the enable settings." range="7 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_EN_CLR" acronym="MMR__VBUSP__CFG1_VTM_GT_TH1_INT_EN_CLR" offset="0x218" width="32" description="Enable clear MMR for interrupt GT_TH1 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH1_INT_EN_SET are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enable bit for gt_th1_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the bit to be cleared. Reads return the enable settings." range="7 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_RAW_STAT_SET" acronym="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_RAW_STAT_SET" offset="0x224" width="32" description="Interrupt RAW event status and set MMR for interrupt GT_TH2 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH2_INT_EN_STAT_CLR are fully linked for write operation, but partially linked for reads, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR. However the reads to these 2 MMRs don't yield the same read data. Reads to *_INT_RAW_STAT_SET return the full raw events contents of the common linked MMR, whereas reads to MMR *_INT_EN_STAT_CLR will yield the masked-content of the linked MMR. The mask for the read is defined by the contents of the related MMR *_INT_EN_SET/CLR.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt pending bit set for gt_th2_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the interrupt flag to be set. Used to manually force/drive an interrupt pending event. Reads return the pending status regardless of the enable setting." range="7 - 0" rwaccess="R/W1TS"/>
	</register>
