IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/VTM0_MMR_VBUSP_CFG1.xml
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_EN_STAT_CLR" acronym="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_EN_STAT_CLR" offset="0x228" width="32" description="Enabled interrupt event status and clear MMR for interrupt GT_TH2 per voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH2_INT_RAW_STAT_SET are fully linked for write operation, but partially linked for reads, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR. However the reads to these 2 MMRs don't yield the same read data. Reads to *_INT_RAW_STAT_SET return the full raw events contents of the common linked MMR, whereas reads to MMR *_INT_EN_STAT_CLR will yield the masked-content of the linked MMR. The mask for the read is defined by the contents of the related MMR *_INT_EN_SET/CLR.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enabled pending bit for gt_th2_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the pending bit to be cleared. Reads return the enabled pending status including the corresponding enable setting." range="7 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_EN_SET" acronym="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_EN_SET" offset="0x234" width="32" description="Enable set MMR for interrupt GT_TH2 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH2_INT_EN_CLR are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enable bit for gt_th2_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the bit to be set to 1. Reads return the enable settings." range="7 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_EN_CLR" acronym="MMR__VBUSP__CFG1_VTM_GT_TH2_INT_EN_CLR" offset="0x238" width="32" description="Enable clear MMR for interrupt GT_TH2 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_GT_TH2_INT_EN_SET are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enable bit for gt_th2_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the bit to be cleared. Reads return the enable settings." range="7 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_RAW_STAT_SET" acronym="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_RAW_STAT_SET" offset="0x244" width="32" description="Interrupt RAW event status and set MMR for interrupt LT_TH0 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_LT_TH0_INT_EN_STAT_CLR are fully linked for write operation, but partially linked for reads, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR. However the reads to these 2 MMRs don't yield the same read data. Reads to *_INT_RAW_STAT_SET return the full raw events contents of the common linked MMR, whereas reads to MMR *_INT_EN_STAT_CLR will yield the masked-content of the linked MMR. The mask for the read is defined by the contents of the related MMR *_INT_EN_SET/CLR.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt pending bit set for lt_th0_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the interrupt flag to be set. Used to manually force/drive an interrupt pending event. Reads return the raw pending status regardless of the corresponding enable setting." range="7 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_EN_STAT_CLR" acronym="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_EN_STAT_CLR" offset="0x248" width="32" description="Enabled interrupt event status and clear MMR for interrupt LT_TH0 per voltage domain. NOTE: This MMR and the companion MMR, VTM_LT_TH0_INT_RAW_STAT_SET are fully linked for write operation, but partially linked for reads, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR. However the reads to these 2 MMRs don't yield the same read data. Reads to *_INT_RAW_STAT_SET return the full raw events contents of the common linked MMR, whereas reads to MMR *_INT_EN_STAT_CLR will yield the masked-content of the linked MMR. The mask for the read is defined by the contents of the related MMR *_INT_EN_SET/CLR.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enabled pending status bit for lt_th0_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the pending bit to be cleared. Reads return the enabled pending status that factors in the corresponding enable along with the pending status." range="7 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_EN_SET" acronym="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_EN_SET" offset="0x254" width="32" description="Enable set MMR for interrupt LT_TH0 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_LT_TH0_INT_EN_CLR are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enable bit for lt_th0_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the bit to be set to 1. Reads return the enable settings." range="7 - 0" rwaccess="R/W1TS"/>
	</register>
