IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/VTM0_MMR_VBUSP_CFG1.xml
	<register id="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_EN_CLR" acronym="MMR__VBUSP__CFG1_VTM_LT_TH0_INT_EN_CLR" offset="0x258" width="32" description="Enable clear MMR for interrupt LT_TH0 for each voltage domain. NOTE: This MMR and the companion MMR, VTM_LT_TH0_INT_EN_SET are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="INT_VD" width="8" begin="7" end="0" resetval="0x0" description="Interrupt enable bit for lt_th0_int from VD[7:0]. Write-operation: 0: Nothing happens. 1: Causes the bit to be cleared. Reads return the enable settings." range="7 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MMR__VBUSP__CFG1_DEVINFO" acronym="MMR__VBUSP__CFG1_DEVINFO" offset="0x100" width="32" description="Voltage domain a information register. The default reset values will not be necessarily overwritten. The write capability in the MMR is for having the option to debug and have software driven adjustments if necessary.">
		<bitfield id="AVS0_SUP" width="1" begin="12" end="12" resetval="0x0" description="Indicates VD0 AVS class0 support. Indicates if the cVD associated with this VTM's VD MMR supports AVS-Class0: 0: No AVS-Class0. 1: Supports-AVS-Class0. Reset value is from e-fuse at module reset, efuse_vd[a]_avs_sup." range="12" rwaccess="R/W"/> 
		<bitfield id="VD_MAP" width="4" begin="11" end="8" resetval="0x0" description="Indicates the core voltage domain mapping of VTM VD. Device specific field. This field indicates to which SOC cVD is this VD of this VTM map to. Valid values: 0x0 to 0xE where: 0x0 = VD_RTC, not present is some SOCs, 0x1 = VD_WKUP, 0x2 = VD_MCU, 0x3 = VD_CORE, not present is some SOCs, 0x4-0xE = Mapping varies between SOCs, 0xF = not implemented. Reset value is a VTM tieoff, d_vd[a]_vd_map_ipcfg." range="11 - 8" rwaccess="R"/>
	</register>
	<register id="MMR__VBUSP__CFG1_OPPVID" acronym="MMR__VBUSP__CFG1_OPPVID" offset="0x104" width="32" description="Voltage domain a VID actual code used as reference by Firmware to set the various voltage domain supply voltages. Reset defaults are sourced from efuse for each OPP. The default reset values will not be necessarily overwritten. The write capability in the MMR is for having the option to debug and have software driven adjustments if necessary.">
		<bitfield id="OPP_3" width="8" begin="31" end="24" resetval="0x0" description="OPP 3 default VID. VID code that represents the required VD value in this Voltage domain to operate at. Valid values are from 0x1e to 0x91. Any value outside that range indicates not implemented including 0x0. This is SOC and device/chip specific. Reset value is from e-fuse at POR, efuse_vd[a]_opp_3." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="OPP_2" width="8" begin="23" end="16" resetval="0x0" description="OPP 2 default VID. VID code that represents the required VD value in this Voltage domain to operate at. Valid values are from 0x1e to 0x91. Any value outside that range indicates not implemented including 0x0. This is SOC and device/chip specific. Reset value is from e-fuse at POR, efuse_vd[a]_opp_2." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="OPP_1" width="8" begin="15" end="8" resetval="0x0" description="OPP 1 default VID. VID code that represents the required VD value in this Voltage domain to operate at. Valid values are from 0x1e to 0x91. Any value outside that range indicates not implemented including 0x0. This is SOC and device/chip specific. Reset value is from e-fuse at POR, efuse_vd[a]_opp_1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="OPP_0" width="8" begin="7" end="0" resetval="0x0" description="OPP 0 default VID. VID code that represents the required VD value in this Voltage domain to operate at. Valid values are from 0x1e to 0x91. Any value outside that range indicates not implemented including 0x0. This is SOC and device/chip specific. Reset value is from e-fuse at POR, efuse_vd[a]_opp_0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG1_EVT_STAT" acronym="MMR__VBUSP__CFG1_EVT_STAT" offset="0x108" width="32" description="Voltage domain a event and control status register.">
		<bitfield id="LT_TH0_ALERT" width="1" begin="2" end="2" resetval="0x0" description="This bit reflects the status of the TH0 undertemp alert resulting from the AND of all the similar alerts produced by the temp sensors selected by VTM_VD[a]_EVT_SEL_SET.tsens_evt_sel." range="2" rwaccess="R"/> 
		<bitfield id="GT_TH2_ALERT" width="1" begin="1" end="1" resetval="0x0" description="This bit reflects the status of the merged temperature alert resulting from the combination of all the similar alerts produced by the temp-monitors selected as showed in field VTM_VD[a]_EVT_SEL_SET.tsens_evt_sel. This field shows the actual present level of the resulting OR function of the combined selected signals." range="1" rwaccess="R"/> 
		<bitfield id="GT_TH1_ALERT" width="1" begin="0" end="0" resetval="0x0" description="This bit reflects the status of the merged temperature alert resulting from the OR of all the similar alerts produced by the temp-monitors selected as showed in field VTM_VD[a]_EVT_SEL_SET.tsens_evt_sel. This field shows the actual present value of the resulting OR function of the combined selected signals." range="0" rwaccess="R"/>
	</register>
	<register id="MMR__VBUSP__CFG1_EVT_SEL_SET" acronym="MMR__VBUSP__CFG1_EVT_SEL_SET" offset="0x10C" width="32" description="Voltage domain a event select and control set register. NOTE: This MMR and the companion MMR  VTM_VD[a]_EVT_SEL_CLR are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="TSENS_EVT_SEL" width="8" begin="23" end="16" resetval="0x0" description="In this field we select which of the event contributions of the 8-maximum possible temp-monitors controlled by this VTM will contribute to generate the merged event/alerts of this VD. Any combination of them could be selected and varies between SOCs and VDs. Eg: 0x00 : No temp-monitor event contributes to generate the temperature events of this VD. 0x06: Temp-monitors[2,1] contribute to generate the temperature events of this VD. ... 0xFF: All 8 temp-monitors contribute to generate the temperature events of this VD. 0: Writing 0 to this field produces no effect. 1: Writing 1 to any of the bits in this field sets to 1 the corresponding bit in that field." range="23 - 16" rwaccess="R/W1TS"/>
	</register>
	<register id="MMR__VBUSP__CFG1_EVT_SEL_CLR" acronym="MMR__VBUSP__CFG1_EVT_SEL_CLR" offset="0x110" width="32" description="Voltage domain a event select and control clear register. NOTE: This MMR and the companion MMR VTM_VD[a]_EVT_SEL_SET are linked, which means that they are in fact a single common MMR, with 2 different write addresses/mechanisms, and thus the single common MMR updates with the writes to either MMR and reads to either of these 2 MMRs read the same content.">
		<bitfield id="TSENS_EVT_SEL" width="8" begin="23" end="16" resetval="0x0" description="In this field we select which of the event contributions of the 8-maximum possible temp-monitors controlled by this VTM will contribute to generate the merged event/alerts of this VD. Any combination of them could be selected and varies between SOCs and VDs. Eg: 0x00 : No temp-monitor event contributes to generate the temperature events of this VD. 0x06: Temp-monitors[2,1] contribute to generate the temperature events of this VD. ... 0xFF: All 8 temp-monitors contribute to generate the temperature events of this VD. 0: Writing 0 to this field produces no effect. 1: Writing 1 to any of the bits in this field clears, = 0, the corresponding bit in that field." range="23 - 16" rwaccess="R/W1TC"/>
	</register>
	<register id="MMR__VBUSP__CFG1_CTRL" acronym="MMR__VBUSP__CFG1_CTRL" offset="0x300" width="32" description="Temperature Sensor Band-gap control register for sensor a.">
		<bitfield id="LT_TH0_EN" width="1" begin="10" end="10" resetval="0x0" description="Enable under-threshold0 event. Temp event/level control: 0 = Don't generate output level. 1 = Enable generation of event/level high when temperature reading is &#60; value set for threshold point 0. Reset value is POR only." range="10" rwaccess="R/W"/> 
		<bitfield id="GT_TH2_EN" width="1" begin="9" end="9" resetval="0x0" description="Enable over-threshold2 event. Temp event/level control: 0 = Don't generate output level. 1 = Enable generation of event/level high when temperature reading is > value set for threshold point 2. Reset value is POR only." range="9" rwaccess="R/W"/> 
		<bitfield id="GT_TH1_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable over-threshold1 event. Temp event/level control: 0 = Don't generate output level. 1 = Enable generation of event/level high when temperature reading is > value set for threshold point 1. Reset value is POR only." range="8" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG1_STAT" acronym="MMR__VBUSP__CFG1_STAT" offset="0x308" width="32" description="Temperature Sensor Band-gap Status register for sensor a.">
		<bitfield id="VD_MAP" width="4" begin="19" end="16" resetval="0x0" description="Indicates the core voltage domain placement of the temp sensor. Device specific field. This field indicates in which core voltage domain, cVD, has been physically placed the temp-monitor. Valid values: 0x0 to 0xE where: 0x0 = VD_RTC, not present is some SOCs, 0x1 = VD_WKUP, 0x2 = VD_MCU, 0x3 = VD_CORE, not present is some SOCs, 0x4-0xE = Mapping varies between SOCs, 0xF = not implemented. Reset value is a VTM tieoff at POR, d_VTM_TMPSENS[a]_STAT_vd_map_ipcfg." range="19 - 16" rwaccess="R"/> 
		<bitfield id="MAXT_OUTRG_ALERT" width="1" begin="15" end="15" resetval="0x0" description="This bit will be driven to a level 1 for a given temperature monitor if it has  its corresponding bit maxt_outrg_en = 1, and the temperature reading is reporting to be outside the max temperature supported, temp > programmed value. The level of this signal is a reflection, with some clock delays, of the temperature code reading. This is NOT an sticky bit. Reset value is POR only." range="15" rwaccess="R"/> 
		<bitfield id="LT_TH0_ALERT" width="1" begin="14" end="14" resetval="0x0" description="This field reflects the status of the lt_th0_alert comparator result. The control MMR field lt_th0_en = 1 is required for this field to become 1. Reset value is at POR or clrz." range="14" rwaccess="R"/> 
		<bitfield id="GT_TH2_ALERT" width="1" begin="13" end="13" resetval="0x0" description="This field reflects the status of the gt_th2_alert comparator result. The control MMR field gt_th2_en = 1 is required for this field to become 1. Reset value is at POR or clrz." range="13" rwaccess="R"/> 
		<bitfield id="GT_TH1_ALERT" width="1" begin="12" end="12" resetval="0x0" description="This field reflects the status of the gt_th1_alert comparator result. The control MMR field gt_th1_en = 1 is required for this field to become 1. Reset value is at POR or clrz." range="12" rwaccess="R"/> 
		<bitfield id="EOC_FC_UPDATE" width="1" begin="11" end="11" resetval="0x0" description="First time end of conversion. This field is reset to 0 every time VTM.por_rst_n or VTM_TMPSENS[a]_CTRL.clrz are active, or when continuous mode is deasserted. This bit will be set to 1 after the first time after reset release that data_valid transitions from 0 to 1, and remain at 1 until next time either of por_rst_n or VTM_TMPSENS[a]_CTRL.clrz are active, or when continuous mode is deasserted. Reset value is at POR or VTM_TMPSENS[a]_CTRL.clrz, or continuous mode deassertion." range="11" rwaccess="R"/> 
		<bitfield id="DATA_VALID" width="1" begin="10" end="10" resetval="0x0" description="Data_valid signal value from sensor: ADC End of Conversion. End of conversion indicated by 0 to 1 transition.  When high data_out(9:0) out of the temp-monitor is valid. This field doesn't reflect the instantaneous output from the temp-monitor. This field gets latched/updated in this VTM register when the data_valid value from temp-monitor toggles. Reset value is at POR or VTM_TMPSENS[a]_CTRL.clrz." range="10" rwaccess="R"/> 
		<bitfield id="DATA_OUT" width="10" begin="9" end="0" resetval="0x0" description="Data_out signal value from sensor: Temperature data from the ADC in monitor. Valid after VTM_TMPSENS[a]_STAT.eoc_fc_update = 1. This value will be latched in this VTM register every time monitor output data_valid transitions from 0 to 1. Reset value is POR only." range="9 - 0" rwaccess="R"/>
	</register>
	<register id="MMR__VBUSP__CFG1_TH" acronym="MMR__VBUSP__CFG1_TH" offset="0x30C" width="32" description="Temperature Sensor Band-gap Threshold register for sensor a.">
		<bitfield id="TH1_VAL" width="10" begin="25" end="16" resetval="0x0" description="Threshold point-1, thpt1, temp-value. Is a 10-bit temperature reference value. This is the 10-bit value that represents a high temperature point, as per sensor spec, with which to compare the present temperature reading, same 10-bit format. If the current temperature reading is > th1_val[9:0] and gt_th1_en=1, that will cause the VTM to set the gt_th1_alert output. Once the current temp reading =&#60; th1_val[9:0] then gt_th1_alert output will go to 0. Reset value is at POR only." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="TH0_VAL" width="10" begin="9" end="0" resetval="0x0" description="Threshold point-0, thpt0, temp-value. Is a 10-bit temperature reference value. This is the 10-bit value that represents a high temperature point, as per sensor spec, with which to compare the present temperature reading, same 10-bit format. If the current temperature reading is &#60; th0_val[9:0] and lt_th0_en=1, that will cause the VTM to set the lt_th0_alert output. Once the current temp reading => th0_val[9:0] then lt_th0_alert output will go to 0. Reset value is at POR only." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG1_TH2" acronym="MMR__VBUSP__CFG1_TH2" offset="0x310" width="32" description="Temperature Sensor Band-gap Threshold register 2 for sensor a.">
		<bitfield id="TH2_VAL" width="10" begin="9" end="0" resetval="0x0" description="Threshold point-2, thpt2, temp-value. Is a 10-bit temperature reference value. This is the 10-bit value that represents a high temperature point, as per sensor spec, with which to compare the present temperature reading, same 10-bit format. If the current temperature reading is > th2_val[9:0] and gt_th2_en=1, that will cause the VTM to set the gt_th2_alert output. Once the current temp reading =&#60; th2_val[9:0] then gt_th2_alert output will go to 0. Reset value is at POR only." range="9 - 0" rwaccess="R/W"/>
	</register>
</module>